IDENTIFICATION DIVISION.
PROGRAM-ID.    MYDEMOFILE.
AUTHOR.        rdoyle.




ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
INPUT-OUTPUT SECTION.

DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
LINKAGE SECTION.



END PROGRAM MYDEMOFILE.
