IDENTIFICATION DIVISION.
PROGRAM-ID.    MYDEMOFILE.
AUTHOR.        rdoyle.




ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
INPUT-OUTPUT SECTION.

DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.

PROCEDURE DIVISION.
MAIN SECTION.

    DISPLAY "Hello World".



END PROGRAM MYDEMOFILE.
