IDENTIFICATION DIVISION.
PROGRAM-ID.     Project_1.
ENVIRONMENT DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.
Main-program section.
    DISPLAY "Hello world from the demo program!".
    STOP RUN.
END PROGRAM Project_1.
